# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Apps
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'java'
cask 'slack'
cask 'sublime-text'
cask 'telegram-desktop'

# Mac App Store
mas 'Magnet', id: 441258766
